# create by pogg
# parameters
nc: 5  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
# angle_num: 180 # 180 for csl, 1 for kfiou

# anchors
anchors:
  - [ 10,13, 16,30, 33,23 ]  # P3/8
  - [ 30,61, 62,45, 59,119 ]  # P4/16
  - [ 116,90, 156,198, 373,326 ]  # P5/32

# custom backbone
backbone:
  # [from, number, module, args]
  [
    [ -1, 1, Conv, [32, 4,4,0 ] ],       # 0-P2/4 160
    [ -1, 1, Conv, [48, 3, 2, 1] ],                 #1  80
    [ -1, 1, Shuffle_Block_ese, [ 48, 1, 3, 1 ] ],  #2
    [ -1, 1, Conv, [96, 3, 2, 1] ],                #3  40
    [ -1, 1, Shuffle_Block_ese, [ 96, 1, 3, 1 ] ], #4
    [ -1, 1, Shuffle_Block_ese, [ 116, 2, 3, 1 ] ], # 5-P5/32  20
    [ -1, 3, Shuffle_Block_ese, [ 116, 1, 3, 1 ] ], # 6
    [ -1, 1, Shuffle_Block_ese, [ 232, 2, 3, 1 ] ], # 7-P6/64  10
    [ -1, 7, Shuffle_Block_ese, [ 232, 1, 3, 1 ] ], # 8
    [ -1, 1, Shuffle_Block_ese, [ 464, 2, 3, 1 ] ], # 9-P7/128  5
    [ -1, 1, Shuffle_Block_ese, [ 464, 1, 3, 1 ] ], # 10
  ]

# v5lite-e head
head:
  [ [ -1, 1, Conv, [ 96, 1, 1 ] ],  # 11
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C2f, [96]],  # 13
   [-1, 2, C2f, [96]],  # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C2f, [96]],  # 17 (P3/8-small)
   [-1, 2, C2f, [96]],  # 18 (P3/8-small)
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat head P4
   [-1, 1, C2f, [96]],  # 21 (P4/16-medium)
   [-1, 2, C2f, [96]],  # 22 (P4/16-medium)
   [-1, 1, Conv, [96, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 1, C2f, [96]],  # 25 (P5/32-large)
   [-1, 2, C2f, [96]],  # 26 (P5/32-large)
   [[18, 22, 26], 1, Detect, [nc,anchors]]  # Detect(P3, P4, P5)
  ]