# create by pogg
# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
angle_num: 180 # 180 for csl, 1 for kfiou
ch: 3
# anchors
anchors:
  - [ 10,13, 16,30, 33,23 ]  # P3/8
  - [ 30,61, 62,45, 59,119 ]  # P4/16
  - [ 116,90, 156,198, 373,326 ]  # P5/32

# custom backbone
backbone:
  [ 
    [ -1, 1, Conv, [16, 4, 4, 0] ],   # 1-P2/4, add downsample x2
    [ -1, 1, Stem_EF, [48] ], 
    [ -1, 1, MetaBlocks, [ 48,0,[3, 2, 6, 4],1]], # 1
    [-1,1,Embedding_EF,[3,2,1,48,96]],
    [ -1, 1, MetaBlocks, [ 96,1,[3, 2, 6, 4],1]], # 3
    [-1,1,Embedding_EF,[3,2,1,96,224]],
    [ -1, 1, MetaBlocks, [ 224,2,[3, 2, 6, 4],1]], # 5
    [-1,1,Embedding_EF,[3,2,1,224,448]],
    [ -1, 1, MetaBlocks, [ 448,3,[3, 2, 6, 4],1]], # 7
  ]

# v5lite-e head
head:
  [ [ -1, 1, Conv, [ 96, 1, 1 ] ], #8
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 6 ], 1, Concat, [ 1 ] ],  # cat backbone P4
    [ -1, 1, DWConvblock, [96, 3, 1] ],  # 11

    [ -1, 1, Conv, [ 96, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 4 ], 1, Concat, [ 1 ] ],  # cat backbone P3
    [ -1, 1, DWConvblock, [96, 3, 1] ],  # 15 (P3/8-small)

    [-1, 1, DWConvblock, [96, 3, 2]],
    [ [ -1, 13 ], 1, ADD, [ 1 ] ],  # cat head P4
    [ -1, 1, DWConvblock, [96, 3, 1] ],  # 18 (P4/16-medium)

    [ -1, 1, DWConvblock, [ 96, 3, 2 ] ],
    [ [ -1, 9 ], 1, ADD, [ 1 ] ],  # cat head P5
    [ -1, 1, DWConvblock, [96, 3, 1] ],  # 21 (P5/32-large)

    [ [ 16, 19, 22 ], 1, Detect, [ nc, anchors ] ],  # Detect(P3, P4, P5)
  ]